Tekla Open API Reference for Tekla Structures 2025
AnalysisFace Methods
The AnalysisFace type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis face.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisFace Class
Tekla.Structures.Analysis Namespace